#Creating Dataframe

To start panda, use the command
pip install pandas if you have not yet installed it 

After that, we need to make a dataframe so we can manipulate data.
Dictionary is the best format from where we can create the dataframe.
In a Dictionary, we need keys and values, the key will be a column and the value will be a list. This list will be the row of that dataframe. In this example, the car will be in the first column, the values of this column will be "city","ignis","800","Verna","Venue","Punto"
Now, to convert this Dictionary to dataframe, we will use pd.DataFrame, which is the method used to convert.

In [1]:
import pandas as pd

In [2]:
dict_1={"car":["city","ignis","800","Verna","Venue","Punto",], "brand":["Honda","maruti","Maruti","hyundia","Hyundia","flat"], "ignis":[9000000,6000000,1000000,8000000,9500000,7500000], "ignis":[5,7,10,4,2,6]}

In [6]:
auto=pd.DataFrame(dict_1)

In [7]:
auto

     car    brand  ignis
0   city    Honda      5
1  ignis   maruti      7
2    800   Maruti     10
3  Verna  hyundia      4
4  Venue  Hyundia      2
5  Punto     flat      6

#Importing Dataframe

Now we will import a real data set.
We will be using a titanic.csv

We use data.head() to visualize this data set.
By default, head function will display the top 5 rows of the data. If you want to view top 10 or 15 rows,
we can use data.head(10) or data.head(15)

Then, we use data.shape to see the number of rows and number of columns.

Now, if we want to know what is the data type of each column, or how many null values are in each column, then we can use the method data.info().

As we can see, we see how many rows are not null and what is the data type of each column. Say, we choose age, we see 714, it means there are 714 rows with no null values in the age column. 

You can see the last column, where it displays the data types.

At the bottom, we can see the summary, dtypes:, that we have 2 float data types, 5 integer data types, and 5 objects.

Object data types means whatever textual data or categorical data we have, will be written as objects.

So, there are 5 columns in which there is textual data.

Now, to see only the name of all the columns, we use data.columns. 

If we use parentheses, it is known as a method or function of that class. But if we don't have parentheses, that is termed as attribute of that class. So, shape and columns are attributes and the rest are methods or functions of the pandas. 

We look at the Embarked column, we see we have categorical values like S, C, and Q. If we want to know how many distinct values there are and what is the count of each distinct value, then we can use .value_counts() method.

We can see we have 3 distinct values like S, C, and Q. We have 645 rows of S as a value, 169 rows of C as a value and 77 rows of Q as a value. 

We use .unique() method to provide us the unique categorical values. Like in sex, we only have male and female. So, it will return only male and female. 

Therefore, we should prefer .value_counts() to .unique() as .value_counts() gives both the number of rows and the values.

In [8]:
import pandas as pd

In [10]:
data=pd.read_csv("titanic.csv")

In [12]:
#head function will display the top 5 rows of the data set
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
data.shape

(891, 12)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
data['Embarked'].value_counts()

S    645
C    169
Q     77
Name: Embarked, dtype: int64

In [17]:
data['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

#Accessing columns

#Now, if we want to access only 1 column, like name column, we can write data['Name'] 
Or, data[['Name', 'Sex']] to access 2 columns. 
Or, data[['Name', 'Sex', 'Pclass']] to access 3 columns.

In [18]:
data['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [19]:
data[['Name', 'Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

#Accessing rows

We use the .iloc method or log method. We pass the first argument as number of row or index or row, and the second argument is the index of columns.

data.iloc[0,:].values 

Here, the first argument is 0, means it will display the first row, and : means everything, so it will displace the complete first row. If we see first 5 rows, we use data.iloc[0:5,:].values, we will see the index 0-4, the first 5 rows.
if we only want to access gender, we use data.iloc[0:5,4].values

We don't know the index, we can also use column name. for example, 
data.loc[1:5,['Name','Sex']]

In [20]:
data.iloc[0,:].values

array([1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0,
       'A/5 21171', 7.25, nan, 'S'], dtype=object)

In [21]:
data.loc[1:5,['Name','Sex']]

                                                Name     Sex
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male
5                                   Moran, Mr. James    male

#Filtering of data

The most important is to know how to filter our data.
we want to see only the rows which have gender as male.
we use: 
new_data=data["Sex"]=="male"
new_data

In [22]:
new_data=data["Sex"]=="male"
new_data

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

#Sorting of data
We sort data according cost, it is in descending order, from lowest to highest order.
auto.sort_values("cost")

#Grouping and Addregation
To group by sex column: 
groups = data.groupby(['Sex'])
To get the mean:
groups.mean()
To get the size, we can see the number of female and male levels:
groups.size()
To get the numbers:
groups.count()
You get good insight of the data in your data set.

In [25]:
groups = data.groupby(['Sex'])

In [26]:
groups.mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [27]:
groups.size()

Sex
female    314
male      577
dtype: int64

In [28]:
groups.count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,314
male,577,577,577,577,453,577,577,577,577,107,577